In [1]:
import numpy as np
import pandas as pd

In [2]:
empWithHeaderDF = pd.read_csv("employeewithheaders.csv")

In [3]:
empWithHeaderDF

   Eid    Ename  Esalary
0    1  Aravind     1000
1    2  Sharada     2000
2    3  Rachael     2000
3    4     Dave     2000
4    5    Rhema     9878
5    6  Rachael     9999

In [4]:
# i want to calculate the yearly salary of each employee on basis of monthly.
# Add a new column named yearlySalary

In [5]:
empWithHeaderDF.Esalary*12 # element wise operation

0     12000
1     24000
2     24000
3     24000
4    118536
5    119988
Name: Esalary, dtype: int64

In [6]:
type(empWithHeaderDF.Esalary*12)

pandas.core.series.Series

In [7]:
empWithHeaderDF["EsalaryYearly"] = empWithHeaderDF.Esalary*12

In [8]:
empWithHeaderDF

   Eid    Ename  Esalary  EsalaryYearly
0    1  Aravind     1000          12000
1    2  Sharada     2000          24000
2    3  Rachael     2000          24000
3    4     Dave     2000          24000
4    5    Rhema     9878         118536
5    6  Rachael     9999         119988

In [9]:
# eSalaryYearly = empWithHeaderDF.Esalary*12 # element wise operation

In [10]:
# eSalaryYearly

In [11]:
# type(eSalaryYearly)

In [12]:
# Pandas Dataframe is a mutable object

In [13]:
# Use-Case 2 : Bonus od the employee
#  New column bonus should be added
# Esalary less than or equal to 1500/- --> 10% increment
# if the salary between 1501 to 6000/----> 5% increment
# if salary between 6001 to 9000/- ------> 2.5% increment
# if salary greater than 9001/- ------------> No increment

In [14]:
# Function must be return updated salary from this month
# when you have multiple checkpoints/ operations to perform , creat function.

In [15]:
def newSalary(Esalary):
    newSalary=0
    
    if Esalary <= 1500:
        newSalary = Esalary * 1.1 # (salary + salary*10%)
    elif Esalary<=6000:
        newSalary = Esalary * 1.05
    elif Esalary<=9000:
        newSalary = Esalary * 1.025
    else:
        newSalary = Esalary
    return newSalary

In [16]:
newSalary(8900)

9122.5

In [17]:
newSalary(5500)

5775.0

In [18]:
# Pandas allows you to apply function on series

In [19]:
updatedSalary = empWithHeaderDF.Esalary.apply(newSalary)

In [20]:
updatedSalary

0    1100.0
1    2100.0
2    2100.0
3    2100.0
4    9878.0
5    9999.0
Name: Esalary, dtype: float64

In [21]:
empWithHeaderDF["updatedMonthlySalary"] = updatedSalary

In [22]:
empWithHeaderDF

   Eid    Ename  Esalary  EsalaryYearly  updatedMonthlySalary
0    1  Aravind     1000          12000                1100.0
1    2  Sharada     2000          24000                2100.0
2    3  Rachael     2000          24000                2100.0
3    4     Dave     2000          24000                2100.0
4    5    Rhema     9878         118536                9878.0
5    6  Rachael     9999         119988                9999.0

In [23]:
empWithHeaderDF["updatedSalaryYearly"] = empWithHeaderDF.updatedMonthlySalary*12

In [24]:
empWithHeaderDF

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly
0,1,Aravind,1000,12000,1100.0,13200.0
1,2,Sharada,2000,24000,2100.0,25200.0
2,3,Rachael,2000,24000,2100.0,25200.0
3,4,Dave,2000,24000,2100.0,25200.0
4,5,Rhema,9878,118536,9878.0,118536.0
5,6,Rachael,9999,119988,9999.0,119988.0

In [25]:
empWithHeaderDF["updatedSalaryYearly"] = empWithHeaderDF.Esalary.apply(newSalary)*12

In [26]:
empWithHeaderDF

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly
0,1,Aravind,1000,12000,1100.0,13200.0
1,2,Sharada,2000,24000,2100.0,25200.0
2,3,Rachael,2000,24000,2100.0,25200.0
3,4,Dave,2000,24000,2100.0,25200.0
4,5,Rhema,9878,118536,9878.0,118536.0
5,6,Rachael,9999,119988,9999.0,119988.0

In [29]:
# adding custom series in an existing dataframe
pd.Series(["HR",'Design','Operation',"PMG","Delivery","Testing"])

0           HR
1       Design
2    Operation
3          PMG
4     Delivery
5      Testing
dtype: object

In [30]:
empWithHeaderDF["Dept"] = pd.Series(["HR",'Design','Operation',"PMG","Delivery","Testing"])

In [31]:
empWithHeaderDF

,Eid,Ename,Esalary,EsalaryYearly,updatedMonthlySalary,updatedSalaryYearly,Dept
0,1,Aravind,1000,12000,1100.0,13200.0,HR
1,2,Sharada,2000,24000,2100.0,25200.0,Design
2,3,Rachael,2000,24000,2100.0,25200.0,Operation
3,4,Dave,2000,24000,2100.0,25200.0,PMG
4,5,Rhema,9878,118536,9878.0,118536.0,Delivery
5,6,Rachael,9999,119988,9999.0,119988.0,Testing

In [35]:
# Export the DF to a file
empWithHeaderDF.to_csv("Finaloutput of empWithHeaderDF1.csv")

In [33]:
# the out put will have defauly index values which 
# is independent column generates with the above code

In [34]:
# best practice is not to have independant index column
empWithHeaderDF.to_csv("Finaloutput of empWithHeaderDF.csv" , index=False)